# -*- coding: utf-8 -*-
import os
filepath = "\\\Ecs01\\pj_est\\2015-TWN\\31-14Q2289A 日勝生大橋頭國小聯開案機電工程\\02估價資料\\02廠商報價\\2015- 廠商報價"
main=["電氣","消防","監控","弱電","給排水","空調"]
M1=["配電盤","發電機","一般燈具","避難逃生設備","插座開關","火警自動警報設備","智慧型受信總機","定址偵煙式感應器 定址式模組","偵煙 差動 定溫感應器 附底座","緊急廣播系統","太陽能", "避雷針設備工程"]		
M2=["泡沫原液(含測試原液)","乾粉滅火器","泡沫原液槽","一齊開放閥 自動警報逆止閥","綜合消防箱(鋼版烤漆)、消防水帶箱、綜合消防栓箱","泡沫比例混合器",
    "泡沫噴頭、撒水頭快速動作型、撒水頭","消防泵浦","風機","風門"]
M3=["中央安全監控系統設備工程","影視系統設備工程","門禁管制設備工程","監視系統設備","停車場管制系統設備","電子佈告欄系統","行動電話強波系統","E-tag系統",
    "FTTH光纖到府設備工程","智能宅內箱系統"]
M4=["共同天線"]
M5=["衛浴設備 衛浴掛架 浴缸","垃圾冷藏設備","水錘吸收器","防震軟管 大位移設備工程","定水位閥","雨水回收處理設備","持壓閥","泵浦","浮球凡而","單槍水龍頭",
    "減壓閥組","進排氣閥","電能熱水器","電磁閥","閥類","精密楔型過濾器","不銹鋼水箱","落水頭","全流量偏心圓塞閥",
    "暗式清潔口","污排水管通氣閥","RC污水人孔","彈性板逆止閥"]
M6=["送排風機","風口風門","避震器","消音箱","浮動地板","全熱交換器"]

for mloop in main:
    fC1 = filepath+"\\"+mloop
    fC1=unicode(fC1,'utf8')
    if not os.path.exists(fC1):
        os.makedirs(fC1)


for MUno in M6:
    FDue = filepath+"\\"+main[5]+"\\"+MUno
    FDue=unicode(FDue,'utf8')
    if not os.path.exists(FDue):
        os.makedirs(FDue)
